In [42]:
import pandas as pd

In [43]:
months = [0,31,28,31,30,31,30,31,31,30,31,30,31]
days = ['mon', 'tue', 'wed', 'thu', 'fri', 'sat', 'sun']

def days_calculator(year):
    ''' Return Total Number of Days in the year by checking if it is a leap year or not'''
    if (year%4==0 and year%100!=0) or year%400==0 :
        return(366)
    return(365)

In [44]:
df = pd.read_csv('musk_data.csv', index_col=0)
df.head()

       Date  Worthy  Day  Label
0  30-12-17       4  Sat    NaN
1  31-12-17       4  Sun    NaN

In [45]:
df.tail(1)

       Date  Worthy  Day  Label
1  31-12-17       4  Sun    NaN

In [46]:
last = df.tail(1)

In [47]:
last

       Date  Worthy  Day  Label
1  31-12-17       4  Sun    NaN

In [48]:
old = tuple(map(int, last['Date'][1].split('-')))
old

(31, 12, 17)

In [49]:
def next_date(old):
    d,m,y = old
    if d<months[m]:
        return((d+1,m,y))
    elif m<12:
        return((1,m+1,y))
    else:
        return((1,1,y+1))

In [50]:
next_date(old)

(1, 1, 18)

In [51]:
old_day = last['Day'][1]
old_day

'Sun'

In [52]:
def next_day(old):
    i = 0
    for i in range(7):
        if days[i]==old:
            break
    i+=1
    i%=7
    return days[i]

next_day(old)

'mon'

In [53]:
df.head()

       Date  Worthy  Day  Label
0  30-12-17       4  Sat    NaN
1  31-12-17       4  Sun    NaN

In [54]:
df.append(['1-1-18'])

c:\users\hp\appdata\local\programs\python\python36\lib\site-packages\pandas\core\indexes\api.py:77: RuntimeWarning: '<' not supported between instances of 'str' and 'int', sort order is undefined for incomparable objects
  result = result.union(other)

       Date  Worthy  Day  Label       0
0  30-12-17     4.0  Sat    NaN     NaN
1  31-12-17     4.0  Sun    NaN     NaN
0       NaN     NaN  NaN    NaN  1-1-18

In [55]:
df.head()

       Date  Worthy  Day  Label
0  30-12-17       4  Sat    NaN
1  31-12-17       4  Sun    NaN

In [69]:
df.loc[len(df)]=['1-1-18',3.5,'Mon','']

In [70]:
df.head()

        Date Worthy  Day Label
 0  30-12-17      4  Sat   NaN
 1  31-12-17      4  Sun   NaN
 2    1-1-18    3.5  Mon
-1    1-1-18    3.5  Mon
 4    1-1-18    3.5  Mon